# Flow Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPNetworkSegmentData..::..Flow Property
MEPNetworkSegmentData Class See Also
---
The calculated flow of this segment, in ft^3/s. The positive value means the flow is from the start to the end node, the negative value means opposite direction.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public double Flow { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Flow As Double
	Get
```

Visual C++
---
```text
public:
property double Flow {
	double get ();
}
```

# See Also
MEPNetworkSegmentData Class
Autodesk.Revit.DB.Analysis Namespace